In [1]:
import numpy as np
import pandas as pd

In [2]:
ser = pd.Series([1,2,3])
ser

0    1
1    2
2    3
dtype: int64

In [3]:
indexList = ['a','b','c','d']
dataList = [1,2,3,4]
ser1 = pd.Series(data = dataList, index = indexList)
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
labels = ['a','b','c','d']
values = np.array([1.0,2.0,3.0,4.0])
ser3 = pd.Series(data = values, index = labels)
ser3

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [5]:
movie_rating = {
    'age': 1,
    'gender': 'F',
    'genres': 'Drama',
    'movie_id': 1193,
    'occupation': 10,
    'rating': 5,
    'timestamp': 978300760,
    'title': "One Flew Over the Cuckoo's Nest (1975)",
    'user_id': 1,
    'zip': '48067'
    }
ser3 = pd.Series(movie_rating)
ser3

age                                                1
gender                                             F
genres                                         Drama
movie_id                                        1193
occupation                                        10
rating                                             5
timestamp                                  978300760
title         One Flew Over the Cuckoo's Nest (1975)
user_id                                            1
zip                                            48067
dtype: object

In [6]:
ser3.index

Index(['age', 'gender', 'genres', 'movie_id', 'occupation', 'rating',
       'timestamp', 'title', 'user_id', 'zip'],
      dtype='object')

In [7]:
ser3.values, type(ser3)

(array([1, 'F', 'Drama', 1193, 10, 5, 978300760,
        "One Flew Over the Cuckoo's Nest (1975)", 1, '48067'], dtype=object),
 pandas.core.series.Series)

In [8]:
ser3.loc['age'], type(ser3.loc['gender'])

(1, str)

In [9]:
ser3.loc[['age','rating']], type(ser3.loc[['age','gender']])

(age       1
 rating    5
 dtype: object, pandas.core.series.Series)

In [10]:
booleans = np.array([False,False,True,False,False,False,True,])

In [11]:
ser3.loc[booleans]

genres           Drama
timestamp    978300760
dtype: object

In [12]:
ser3.loc['age':]

age                                                1
gender                                             F
genres                                         Drama
movie_id                                        1193
occupation                                        10
rating                                             5
timestamp                                  978300760
title         One Flew Over the Cuckoo's Nest (1975)
user_id                                            1
zip                                            48067
dtype: object

In [13]:
ser3.iloc[3:4]

movie_id    1193
dtype: object

In [14]:
ser3.ix[1], ser3.ix['gender']

/home/nitesh/Desktop/python_projects/env-2/lib/python3.4/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

('F', 'F')

In [15]:
ser3.ix[[0,1]], ser3.ix[['age','gender']]

(age       1
 gender    F
 dtype: object, age       1
 gender    F
 dtype: object)

In [16]:
ser3.ix[0:4]

age             1
gender          F
genres      Drama
movie_id     1193
dtype: object

In [17]:
ser3.ix['age':'user_id']

age                                                1
gender                                             F
genres                                         Drama
movie_id                                        1193
occupation                                        10
rating                                             5
timestamp                                  978300760
title         One Flew Over the Cuckoo's Nest (1975)
user_id                                            1
dtype: object

In [18]:
ser11 = pd.Series(data = [1,3,4], index =['A','B','C'])
ser12 = pd.Series(data = [1,3,4], index =['D','E','F'])
ser11 + ser12

A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
F   NaN
dtype: float64

In [19]:
ser11 = pd.Series(data = [1,3,4], index =['A','B','C'])
ser12 = pd.Series(data = [1,3,4], index =['A','D','C'])
ser11 + ser12

A    2.0
B    NaN
C    8.0
D    NaN
dtype: float64

In [20]:
dict1 = {'col_1':[1,2,4], 'col_2':[1,3,5]}

In [21]:
pd.DataFrame({'col_1':[1,2,4], 'col_2':[1,3,5]})

   col_1  col_2
0      1      1
1      2      3
2      4      5

In [22]:
pd.DataFrame(data = {'col_1':[1,2,4], 'col_2':[1,3,5]}, index=['a','b','c'], columns=['col_1','col_2','col3'])

   col_1  col_2 col3
a      1      1  NaN
b      2      3  NaN
c      4      5  NaN

In [23]:
pd.DataFrame({'col_1':[1,2,4], 'col_2':[1,3,5]}, index=['a','b','c'], columns=['col_1','col_2','col3'])

   col_1  col_2 col3
a      1      1  NaN
b      2      3  NaN
c      4      5  NaN

In [24]:
movie_rating = {
    'gender': 'F',
    'genres': 'Drama',
    'movie_id': 1193,
    'rating': 5,
    'timestamp': 978300760,
    'user_id': 1,
    }

movie_rating1 = {
    'gender': 'M',
    'genres': 'Action',
    'movie_id': 1143,
    'rating': 4,
    'timestamp': 978200760,
    'user_id': 3,
    }
ser_1 = pd.Series(movie_rating)
ser_2 = pd.Series(movie_rating1)
df = pd.DataFrame({'r_1': ser_1, 'r_2': ser_2})
df.columns.name = 'rating_events'
df.index.name = 'rating_data'
df

rating_events        r_1        r_2
rating_data
gender                 F          M
genres             Drama     Action
movie_id            1193       1143
rating                 5          4
timestamp      978300760  978200760
user_id                1          3

In [25]:
dff = df

In [26]:
df['r_3'] = ['M','War',1907,3,978200760,5]
df

rating_events        r_1        r_2        r_3
rating_data
gender                 F          M          M
genres             Drama     Action        War
movie_id            1193       1143       1907
rating                 5          4          3
timestamp      978300760  978200760  978200760
user_id                1          3          5

In [27]:
movie_rating4 = {
    'gender': 'M',
    'genres': 'Action',
    'movie_id': 1143,
    'rating': 4,
    'timestamp': 978200760,
    'user_id': 3,
    }
ser_4 = pd.Series(movie_rating4)

In [28]:
df['r_4'] = ser_4
df

rating_events        r_1        r_2        r_3        r_4
rating_data
gender                 F          M          M          M
genres             Drama     Action        War     Action
movie_id            1193       1143       1907       1143
rating                 5          4          3          4
timestamp      978300760  978200760  978200760  978200760
user_id                1          3          5          3

In [29]:
df1 = df.drop('genres', axis = 0, inplace=True)

In [30]:
df

rating_events        r_1        r_2        r_3        r_4
rating_data
gender                 F          M          M          M
movie_id            1193       1143       1907       1143
rating                 5          4          3          4
timestamp      978300760  978200760  978200760  978200760
user_id                1          3          5          3

In [31]:
dff

rating_events        r_1        r_2        r_3        r_4
rating_data
gender                 F          M          M          M
movie_id            1193       1143       1907       1143
rating                 5          4          3          4
timestamp      978300760  978200760  978200760  978200760
user_id                1          3          5          3

In [32]:
df.drop('r_3', axis = 1)

rating_events        r_1        r_2        r_4
rating_data
gender                 F          M          M
movie_id            1193       1143       1143
rating                 5          4          4
timestamp      978300760  978200760  978200760
user_id                1          3          3

In [33]:
df.drop('r_4', inplace=True,axis = 1)

In [34]:
df

rating_events        r_1        r_2        r_3
rating_data
gender                 F          M          M
movie_id            1193       1143       1907
rating                 5          4          3
timestamp      978300760  978200760  978200760
user_id                1          3          5

In [35]:
dff.drop('r_3', axis = 1, inplace=True)

In [36]:
dff

rating_events        r_1        r_2
rating_data
gender                 F          M
movie_id            1193       1143
rating                 5          4
timestamp      978300760  978200760
user_id                1          3

In [37]:
df

rating_events        r_1        r_2
rating_data
gender                 F          M
movie_id            1193       1143
rating                 5          4
timestamp      978300760  978200760
user_id                1          3

In [38]:
df['r_1']

rating_data
gender               F
movie_id          1193
rating               5
timestamp    978300760
user_id              1
Name: r_1, dtype: object

In [39]:
df[['r_1','r_2']]

rating_events        r_1        r_2
rating_data
gender                 F          M
movie_id            1193       1143
rating                 5          4
timestamp      978300760  978200760
user_id                1          3

In [40]:
df.r_1

rating_data
gender               F
movie_id          1193
rating               5
timestamp    978300760
user_id              1
Name: r_1, dtype: object

In [101]:
df.loc['rating'], df.iloc[2]

(rating_events
 r_1    5
 r_2    4
 Name: rating, dtype: object, rating_events
 r_1    5
 r_2    4
 Name: rating, dtype: object)

In [103]:
df.loc['rating','r_1'],  df.iloc[2,0]

(5, 5)

In [105]:
df.ix['rating'], df.ix[2]

(rating_events
 r_1    5
 r_2    4
 Name: rating, dtype: object, rating_events
 r_1    5
 r_2    4
 Name: rating, dtype: object)

In [106]:
df.ix['rating','r_1'], df.ix[2,0]

(5, 5)

In [107]:
df.loc['movie_id':'timestamp']

rating_events        r_1        r_2
rating_data
movie_id            1193       1143
rating                 5          4
timestamp      978300760  978200760

In [109]:
df.loc['movie_id':'timestamp','r_1']

rating_data
movie_id          1193
rating               5
timestamp    978300760
Name: r_1, dtype: object

In [50]:
df.loc['movie_id':'timestamp','r_1':'r_2']

rating_events        r_1        r_2
rating_data
movie_id            1193       1143
rating                 5          4
timestamp      978300760  978200760

In [116]:
df.iloc[1:4,0:2]

rating_events        r_1        r_2
rating_data
movie_id            1193       1143
rating                 5          4
timestamp      978300760  978200760